app/Models/AlunosModel.php

        public function getAlunos(){
            return $this->findAll();
---
SELECT *
FROM `tb_aluno`

        public function getAluno($id){
            return $this->asArray()->where(['id'=>$id])->first();
---
SELECT *
FROM `tb_aluno`
WHERE `tb_aluno`.`id` = '2'